fe40/tutorials/rheoFoam/fluidDamper/CarreauYasuda/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            zeroGradient;
    }

    right
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }
    
    piston
    {
        type            zeroGradient;
    }
    
    shaft
    {
        type            zeroGradient;
    }

    wedge0
    {
        type            wedge;
    }
    
    wedge1
    {
        type            wedge;
    }
    
}

// ************************************************************************* //
