fe40/tutorials/rheoFoam/fluidDamper/CarreauYasuda/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rheoInterFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         .0625; 

deltaT          1e-5;

writeControl    timeStep;

writeInterval   125;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  false;

maxCo           0.05;

maxAlphaCo      0.05;

maxDeltaT       0.1;
// ************************************************************************* //
