fe40/tutorials/rheoFoam/fluidDamper/CarreauYasuda/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|Phi)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           0;
        minIter          0;
        maxIter          800;
        
    }

    "(theta|tau|U)"
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-10;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }
    
    "(cell.*)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }
 
}

PostProcessing
{

 functions
 (
 
   forceMonitor
   {
     funcType           calcFfl;
     enabled            true;
     evaluateInterval   50;     
   }
   
 );
 
}

SIMPLE
{
    nInIter         2;
    nNonOrthogonalCorrectors 0;
    pRefCell        1000;
    pRefValue       0;
    
    
    correctPhi      false;

    residualControl
    {
        
    }
}

relaxationFactors
{
   
}

// ************************************************************************* //
